export const HOLIDAYS_2019 = {
    1: {
        1: '신정',
    },
    2: {
        4: '설날 연휴',
        5: '설날',
        6: '설날 연휴',
    },
    3: {
        1: '삼일절',
    },
    4: {},
    5: {
        5: '어린이날',
        6: '어린이날 대체공휴일',
        12: '부처님오신날',
    },
    6: {
        6: '현충일',
    },
    7: {},
    8: {
        15: '광복절',
    },
    9: {
        12: '추석 연휴',
        13: '추석',
        14: '추석 연휴',
    },
    10: {
        3: '개천절',
        9: '한글날',
    },
    11: {},
    12: {
        25: '성탄절',
    },
};
