export const HOLIDAYS_2020 = {
    1: {
        1: '신정',
        24: '설날 연휴',
        25: '설날',
        26: '설날 연휴',
        27: '대체공휴일',
    },
    2: {},
    3: {
        1: '삼일절',
    },
    4: {
        15: '제21대 국회의원 선거',
        30: '부처님오신날',
    },
    5: {
        1: '근로자의 날',
        5: '어린이날',
    },
    6: {
        6: '현충일',
    },
    7: {},
    8: {
        15: '광복절',
        17: '임시공휴일',
    },
    9: {
        30: '추석 연휴',
    },
    10: {
        1: '추석',
        2: '추석 연휴',
        3: '개천절',
        9: '한글날',
    },
    11: {},
    12: {
        25: '성탄절',
    },
};
