export const HOLIDAYS_2023 = {
    1: {
        1: '신정',
        21: '설날 연휴',
        22: '설날',
        23: '설날 연휴',
        24: '대체공휴일',
    },
    2: {},
    3: {
        1: '삼일절',
    },
    4: {},
    5: {
        1: '근로자의 날',
        5: '어린이날',
        27: '부처님오신날',
        29: '부처님오신날 대체공휴일',
    },
    6: {
        6: '현충일',
    },
    7: {},
    8: {
        15: '광복절',
    },
    9: {
        28: '추석 연휴',
        29: '추석',
        30: '추석 연휴',
    },
    10: {
        2: '추석 임시공휴일',
        3: '개천절',
        9: '한글날',
    },
    11: {},
    12: {
        25: '성탄절',
    },
};
