export var HOLIDAYS_2025 = {
    1: {
        1: true, // 새해
        27: true, // 설 임시공휴일
        28: true, // 설 연휴
        29: true, // 설
        30: true, // 설 연휴
    },
    2: {},
    3: {
        1: true, // 삼일절
        3: true, // 삼일절 대체공휴일
    },
    4: {},
    5: {
        1: true, // 근로자의 날
        5: true, // 어린이날, 부처님 오신날
        6: true, // 부처님 오신날 대체공휴일
    },
    6: {
        3: true, // 21대 대통령 선거
        6: true, // 현충일
    },
    7: {},
    8: {
        15: true, // 광복절
    },
    9: {},
    10: {
        3: true, // 개천절
        5: true, // 추석 연휴
        6: true, // 추석
        7: true, // 추석 연휴
        8: true, // 추석 대체공휴일
        9: true, // 한글날
    },
    11: {},
    12: {
        25: true, // 성탄절
    },
};
