export const HOLIDAYS_2026 = {
    1: {
        1: '신정',
    },
    2: {
        16: '설날 연휴',
        17: '설날',
        18: '설날 연휴',
    },
    3: {
        1: '삼일절',
        2: '삼일절 대체공휴일',
    },
    4: {},
    5: {
        1: '노동절',
        5: '어린이날',
        24: '부처님오신날',
        25: '부처님오신날 대체공휴일',
    },
    6: {
        3: '제9회 전국동시지방선거',
        6: '현충일',
    },
    7: {
        17: '제헌절',
    },
    8: {
        15: '광복절',
        17: '광복절 대체공휴일',
    },
    9: {
        24: '추석 연휴',
        25: '추석',
        26: '추석 연휴',
    },
    10: {
        3: '개천절',
        5: '개천절 대체공휴일',
        9: '한글날',
    },
    11: {},
    12: {
        25: '성탄절',
    },
};
