import type { IYearHolidays } from './types.js';

export const HOLIDAYS_2021: IYearHolidays = {
  1: {
    1: '신정',
  },
  2: {
    11: '설날 연휴',
    12: '설날',
    13: '설날 연휴',
  },
  3: {
    1: '삼일절',
  },
  4: {},
  5: {
    1: '근로자의 날',
    5: '어린이날',
    19: '부처님오신날',
  },
  6: {
    6: '현충일',
  },
  7: {},
  8: {
    15: '광복절',
    16: '광복절 대체공휴일',
  },
  9: {
    20: '추석 연휴',
    21: '추석 연휴',
    22: '추석 연휴',
  },
  10: {
    3: '개천절',
    4: '개천절 대체공휴일',
    9: '한글날',
    11: '한글날 대체공휴일',
  },
  11: {},
  12: {
    25: '성탄절',
  },
};
