import type { IYearHolidays } from './types.js';

export const HOLIDAYS_2022: IYearHolidays = {
  1: {
    1: '신정',
    31: '설날 연휴',
  },
  2: {
    1: '설날',
    2: '설날 연휴',
  },
  3: {
    1: '삼일절',
    9: '제20대 대통령 선거',
  },
  4: {},
  5: {
    1: '근로자의 날',
    5: '어린이날',
    8: '부처님오신날',
  },
  6: {
    1: '제8회 전국동시지방선거',
    6: '현충일',
  },
  7: {},
  8: {
    15: '광복절',
  },
  9: {
    9: '추석 연휴',
    10: '추석 연휴',
    11: '추석 연휴',
    12: '추석 대체공휴일',
  },
  10: {
    3: '개천절',
    9: '한글날',
    10: '한글날 대체공휴일',
  },
  11: {},
  12: {
    25: '성탄절',
  },
};
