import type { IYearHolidays } from './types.js';

export const HOLIDAYS_2024: IYearHolidays = {
  1: {
    1: '신정',
  },
  2: {
    9: '설날 연휴',
    10: '설날',
    11: '설날 연휴',
    12: '대체공휴일',
  },
  3: {
    1: '삼일절',
  },
  4: {
    10: '제22대 국회의원 선거',
  },
  5: {
    1: '근로자의 날',
    5: '어린이날',
    6: '어린이날 대체공휴일',
    15: '부처님오신날',
  },
  6: {
    6: '현충일',
  },
  7: {},
  8: {
    15: '광복절',
  },
  9: {
    16: '추석 연휴',
    17: '추석',
    18: '추석 연휴',
  },
  10: {
    1: '국군의 날 임시공휴일',
    3: '개천절',
    9: '한글날',
  },
  11: {},
  12: {
    25: '성탄절',
  },
};
