"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.HOLIDAYS_2025 = void 0;
exports.HOLIDAYS_2025 = {
    1: {
        1: '신정',
        27: '설날 임시공휴일',
        28: '설날 연휴',
        29: '설날',
        30: '설날 연휴',
    },
    2: {},
    3: {
        1: '삼일절',
        3: '삼일절 대체공휴일',
    },
    4: {},
    5: {
        1: '근로자의 날',
        5: '어린이날, 부처님오신날',
        6: '부처님오신날 대체공휴일',
    },
    6: {
        3: '제21대 대통령 선거',
        6: '현충일',
    },
    7: {},
    8: {
        15: '광복절',
    },
    9: {},
    10: {
        3: '개천절',
        5: '추석 연휴',
        6: '추석',
        7: '추석 연휴',
        8: '추석 대체공휴일',
        9: '한글날',
    },
    11: {},
    12: {
        25: '성탄절',
    },
};
